haneefdm/mclasswifi/STM32H747I-DISCO/STM32H747I-DISCO.ioc
#MicroXplorer Configuration settings - do not modify
PF7.GPIOParameters=GPIO_Label,PinAttribute
PD7.Mode=IN0
PB13.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D0_DA0.ConfNb=1
PI7.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A8.ConfNb=1
SH.FMC_A0.ConfNb=1
SH.FMC_D6_DA6.ConfNb=1
SH.FMC_D9_DA9.ConfNb=1
SH.FMC_A0.0=FMC_A0,13b-sda1
PE11.GPIOParameters=GPIO_Label,PinAttribute
PH15.GPIO_Label=FMC_D23
PH0-OSC_IN\ (PH0).PinAttribute=CortexM7
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:true\:false\:true
PI10.PinAttribute=CortexM4
PG8.Signal=FMC_SDCLK
PG8.Locked=true
PG0.Locked=true
PI15.Locked=true
PG0.Signal=FMC_A10
PC3_C.Mode=IN1-Single-Ended
FREERTOS_M4.IPParameters=Tasks01
PD8.Locked=true
SAI1.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
PI15.GPIO_Label=LED4
RCC.RTCFreq_Value=32000
PA5.PinAttribute=CortexM4
PD0.Locked=true
RCC.CpuClockFreq_Value=64000000
PD2.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_SDNWE.ConfNb=1
PG14.GPIOParameters=GPIO_Label,PinAttribute
PK1.Signal=SPI5_NSS
USART1.IPParameters=VirtualMode-Asynchronous
SH.FMC_D5_DA5.0=FMC_D5,sd-32b-d1
PA2.GPIOParameters=GPIO_Label,PinAttribute
PG2.GPIOParameters=GPIO_Label,PinAttribute
USB_OTG_HS.VirtualMode-Device_HS=Device_HS
PB6.PinAttribute=CortexM4
SH.FMC_D9_DA9.0=FMC_D9,sd-32b-d1
RCC.LPTIM1Freq_Value=64000000
SH.FMC_D25.0=FMC_D25,sd-32b-d1
NVIC2.CEC_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
SH.FMC_NBL2.ConfNb=1
PG15.GPIO_Label=FMC_SDCAS
PF7.Signal=QUADSPI_BK1_IO2
SH.FMC_SDNWE.0=FMC_SDNWE,13b-sda1
NVIC1.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PI11.PinAttribute=CortexM4
PH9.Signal=FMC_D17
SH.FMC_D11_DA11.0=FMC_D11,sd-32b-d1
RCC.I2C4Freq_Value=64000000
PB6.Signal=CEC
PD0.Signal=FMC_D2_DA2
PD8.Signal=FMC_D13_DA13
PE1.Signal=FMC_NBL1
PE14.Locked=true
ProjectManager.ProjectBuild=false
PC8.PinAttribute=CortexM4
PJ12.GPIOParameters=GPIO_Label,PinAttribute
PA8.Locked=true
PF1.GPIO_Label=FMC_A1
PK4.GPIO_Label=JOY_LEFT
PI4.GPIO_Label=FMC_NBL2
PJ10.GPIOParameters=GPIO_Label,PinAttribute
PD1.GPIO_Label=FMC_D3
PB12.GPIO_Label=ULPI_D5
PG14.Mode=Dual_Bank
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.7.0
PF12.GPIO_Label=FMC_A6
PI7.Locked=true
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=64000000
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.GPIO_Label=ETH_RXD0
PG12.GPIOParameters=GPIO_Label,PinAttribute
PE9.Signal=FMC_D6_DA6
PI2.Locked=true
SH.FMC_A2.0=FMC_A2,13b-sda1
PE9.Locked=true
PD8.PinAttribute=CortexM4
PB1.GPIO_Label=ULPI_D2
PI12.PinAttribute=Free
RCC.USART16Freq_Value=64000000
PE4.GPIO_Label=SAI1_FS_A
PG4.GPIO_Label=FMC_BA0
PC9.Mode=SD_4_bits_Wide_bus
PF10.Locked=true
PF13.Locked=true
VP_SYS_M4_VS_Systick.Mode=SysTick
PI15.GPIOParameters=GPIO_Label,PinAttribute
VP_FREERTOS_M4_VS_CMSIS_V2.Signal=FREERTOS_M4_VS_CMSIS_V2
PA8.Signal=RCC_MCO_1
PF2.Locked=true
PE1.Locked=true
SH.FMC_D1_DA1.0=FMC_D1,sd-32b-d1
PB6.Locked=true
USB_OTG_HS.IPParameters=VirtualMode-Device_HS
PA3.PinAttribute=CortexM4
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=129000000
PA7.PinAttribute=CortexM4
Mcu.Package=TFBGA240
PB1.Signal=USB_OTG_HS_ULPI_D2
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
PB15.PinAttribute=Free
PJ11.Locked=true
SH.FMC_SDNCAS.ConfNb=1
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PJ8.Locked=true
PC3_C.GPIO_Label=ARD_A5
SH.FMC_A11.ConfNb=1
SH.FMC_D27.0=FMC_D27,sd-32b-d1
PA10.Signal=USART1_RX
PJ3.Locked=true
PE12.GPIO_Label=FMC_D9
PH6.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PF7.Locked=true
Mcu.Context0=CortexM7
Mcu.Context1=CortexM4
PH9.Locked=true
SPI5.CalculateBaudRate=32.0 MBits/s
PD7.PinAttribute=CortexM4
PC14-OSC32_IN\ (OSC32_IN).Mode=LSE-External-Oscillator
RCC.LPUART1Freq_Value=64000000
PF10.Mode=IN6-Single-Ended
PB13.Mode=Device_HS
PE6.Locked=true
PJ0.Locked=true
PK1.Locked=true
PD15.Signal=FMC_D1_DA1
PJ1.GPIO_Label=OTG_HS_OverCurrent
RCC.VCO3OutputFreq_Value=258000000
SH.FMC_D3_DA3.ConfNb=1
PG12.Signal=ETH_TXD1
PA5.Mode=Device_HS
PG12.PinAttribute=CortexM4
Mcu.Pin80=PF9
Mcu.Pin81=PJ10
PK4.Signal=GPIO_Input
SH.FMC_A4.0=FMC_A4,13b-sda1
ProjectManager.ProjectFileName=STM32H747I-DISCO.ioc
SH.FMC_A5.ConfNb=1
PH13.Locked=true
PH13.Signal=FMC_D21
Mcu.Pin79=PF10
PA0_C.Locked=true
ADC3.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
PI10.Locked=true
Mcu.PinsNb=154
PA1.PinAttribute=CortexM4
PC14-OSC32_IN\ (OSC32_IN).GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin73=PK1
Mcu.Pin74=PF6
Mcu.Pin71=PF4
Mcu.Pin72=PK0
PC13.Locked=true
Mcu.Pin77=PJ11
SAI1.MClockEnable-SAI_A_MasterWithClock=SAI_MASTERCLOCK_ENABLE
Mcu.Pin78=PC0
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
Mcu.Pin75=PF7
PA1_C.GPIO_Label=ARD_A3
PC13.Signal=RTC_TAMP1
PG3.Locked=true
Mcu.Pin76=PF8
SH.FMC_D10_DA10.0=FMC_D10,sd-32b-d1
Mcu.Pin70=PF5
PG9.Mode=Dual_Bank
PC2.Signal=SPI2_MISO
PF9.PinAttribute=CortexM4
PI12.Signal=GPIO_Output
SAI1.ErrorAudioFreq-SAI_A_MasterWithClock=31.22 %
SH.FMC_D16.0=FMC_D16,sd-32b-d1
Mcu.Pin68=PH1-OSC_OUT (PH1)
Mcu.Pin69=PH0-OSC_IN (PH0)
PE8.PinAttribute=CortexM4
PB14.Locked=true
Mcu.Pin62=PI14
PG14.Locked=true
Mcu.Pin63=PF3
Mcu.Pin60=PI12
Mcu.Pin61=PI13
PA9.PinAttribute=CortexM7
Mcu.Pin66=PG2
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE1
Mcu.Pin67=PK2
Mcu.Pin64=PG4
Mcu.Pin65=PG3
PG13.PinAttribute=CortexM4
PJ11.Signal=SPI5_MISO
PF8.GPIO_Label=PMOD\#14/ARD_D3
ETH.IPParameters=MediaInterface
PC3.GPIOParameters=GPIO_Label,PinAttribute
PD10.Signal=FMC_D15_DA15
RCC.D1CPREFreq_Value=64000000
PA3.Mode=Device_HS
PB2.PinAttribute=CortexM4
PJ8.GPIO_Label=ARD_D1
PJ3.Signal=GPIO_Input
RCC.Tim1OutputFreq_Value=64000000
PI8.GPIO_Label=uSD_Detect
PA8.GPIO_Label=CEC_CK/MCO1
SH.FMC_D29.0=FMC_D29,sd-32b-d1
Mcu.Pin59=PG6
Mcu.Pin57=PF1
PC15-OSC32_OUT\ (OSC32_OUT).Locked=true
Mcu.Pin58=PF0
PH11.GPIOParameters=GPIO_Label,PinAttribute
PA2.PinAttribute=CortexM4
PH4.Locked=true
Mcu.Pin51=PA11
Mcu.Pin52=PI10
Mcu.Pin50=PA12
RCC.PLLDSIVCOFreq_Value=1000000000
Mcu.Pin55=PG7
PA0_C.GPIO_Label=ARD_A2
Mcu.Pin56=PF2
Mcu.Pin53=PI11
Mcu.Pin54=PG8
PE8.GPIO_Label=FMC_D5
PH11.GPIO_Label=FMC_D19
SH.ADCx_INP1.ConfNb=1
PB11.GPIOParameters=GPIO_Label,PinAttribute
PI12.Locked=true
PJ11.GPIO_Label=ARD_D12
PI3.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin48=PC9
Mcu.Pin49=PA8
PH13.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin46=PD1
Mcu.Pin47=PC8
SAI1.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
TIM13.IPParameters=Channel
PF3.GPIOParameters=GPIO_Label,PinAttribute
PG6.GPIOParameters=GPIO_Label,PinAttribute
PJ6.GPIOParameters=GPIO_Label,PinAttribute
PB14.Signal=GPIO_Input
Mcu.Pin40=PH13
PA5.Signal=USB_OTG_HS_ULPI_CK
Mcu.Pin41=PI9
PE13.GPIOParameters=GPIO_Label,PinAttribute
PC12.Mode=SD_4_bits_Wide_bus
Mcu.Pin44=PE6
Mcu.Pin45=PJ13
Mcu.Pin42=PC13
PG11.PinAttribute=CortexM4
Mcu.Pin43=PI8
PJ4.GPIO_Label=ARD_D4
PE1.GPIO_Label=FMC_NBL1
PG9.PinAttribute=CortexM4
PK7.GPIO_Label=TOUCH_INT
PI7.Signal=FMC_D29
PB1.PinAttribute=CortexM4
PC2_C.GPIO_Label=ARD_A4
SH.FMC_A6.0=FMC_A6,13b-sda1
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.AHB12Freq_Value=64000000
PE14.Signal=FMC_D11_DA11
PE6.Mode=SAI_A_MasterWithClock
Mcu.Pin37=PD0
Mcu.Pin38=PA10
Mcu.Pin35=PJ12
PB15.GPIO_Label=PMOD\#8
Mcu.Pin36=PD2
SH.FMC_D14_DA14.ConfNb=1
Mcu.Pin39=PA9
PG7.GPIO_Label=SAI1_MCLK_A
PI2.Signal=FMC_D26
PF4.GPIO_Label=FMC_A4
Mcu.Pin30=PE3
PA1.GPIO_Label=ETH_REF_CLK
Mcu.Pin33=PG14
Mcu.Pin34=PG13
Mcu.Pin31=PG15
Mcu.Pin32=PK7
PF13.Signal=FMC_A7
PC10.GPIOParameters=GPIO_Label,PinAttribute
PJ15.GPIO_Label=Audio_INT
SH.FMC_NBL2.0=FMC_NBL2,Sd4ByteEnable1
PC9.GPIOParameters=GPIO_Label,PinAttribute
PF9.GPIOParameters=GPIO_Label,PinAttribute
PI9.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin26=PC12
SH.FMC_D18.0=FMC_D18,sd-32b-d1
Mcu.Pin27=PI3
Mcu.Pin24=PG12
SH.FMC_D21.ConfNb=1
Mcu.Pin25=PD7
Mcu.Pin28=PE5
Mcu.Pin29=PE4
PC8.Mode=SD_4_bits_Wide_bus
ADC3.Rank-1\#ChannelRegularConversion=1
PD14.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin22=PK6
ETH.MediaInterface=HAL_ETH_RMII_MODE
Mcu.Pin23=PK3
PA8.PinAttribute=CortexM7
Mcu.Pin20=PC14-OSC32_IN (OSC32_IN)
ADC1.master=1
Mcu.Pin21=PE0
PA3.Locked=true
PJ0.GPIOParameters=GPIO_Label,PinAttribute
PD10.Locked=true
PC14-OSC32_IN\ (OSC32_IN).GPIO_Label=OSC32_IN
PA10.Locked=true
PA5.GPIO_Label=ULPI_CK
PC12.GPIO_Label=SDIO1_CK
PE5.GPIO_Label=SAI1_SCK_A
PD15.Locked=true
PJ8.Signal=UART8_TX
PJ0.GPIO_Label=ARD_D7
PE9.PinAttribute=CortexM4
SH.FMC_SDNRAS.ConfNb=1
ProjectManager.HeapSize=0x200
Mcu.Pin15=PC11
Mcu.Pin16=PI2
PB1.Mode=Device_HS
Mcu.Pin13=PG11
Mcu.Pin14=PJ15
PH6.Signal=FMC_SDNE1
Mcu.Pin19=PC15-OSC32_OUT (OSC32_OUT)
PF10.GPIOParameters=GPIO_Label,PinAttribute
PD9.PinAttribute=CortexM4
Mcu.Pin17=PH15
Mcu.Pin18=PH14
Mcu.Pin11=PB6
Mcu.Pin12=PK4
PD0.GPIOParameters=GPIO_Label,PinAttribute
PF0.GPIO_Label=FMC_A0
PG0.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin10=PE1
PD15.PinAttribute=CortexM4
PI11.GPIO_Label=ULPI_DIR
PE3.Signal=SAI1_SD_B
PC9.PinAttribute=CortexM4
PF4.Signal=FMC_A4
SH.FMC_D26.ConfNb=1
PD2.Signal=SDMMC1_CMD
PC1.PinAttribute=CortexM4
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC1.Mode=RMII
PI1.GPIO_Label=FMC_D25
PG15.Locked=true
Mcu.Family=STM32H7
ProjectManager.MainLocation=Src
PD2.PinAttribute=CortexM4
SH.FMC_A6.ConfNb=1
PK3.Signal=GPIO_Input
SPI2.VirtualNSS=VM_NSSHARD
SH.FMC_A8.0=FMC_A8,13b-sda1
PB10.PinAttribute=CortexM4
PG7.PinAttribute=CortexM4
PG9.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin150=VP_RTC_VS_RTC_Activate
Mcu.Pin151=VP_SYS_VS_Systick
ProjectManager.KeepUserCode=true
PH14.Signal=FMC_D22
PH10.Signal=FMC_D18
SH.FMC_D14_DA14.0=FMC_D14,sd-32b-d1
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PG2.Signal=FMC_A12
PE11.GPIO_Label=FMC_D8
PA1_C.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin152=VP_SYS_M4_VS_Systick
Mcu.Pin153=VP_TIM13_VS_ClockSourceINT
PG2.Locked=true
PC15-OSC32_OUT\ (OSC32_OUT).Mode=LSE-External-Oscillator
PC5.Locked=true
PF0.GPIOParameters=GPIO_Label,PinAttribute
PA12.GPIOParameters=GPIO_Label,PinAttribute
PA9.GPIOParameters=GPIO_Label,PinAttribute
PA11.GPIOParameters=GPIO_Label,PinAttribute
PD0.GPIO_Label=FMC_D2
PA11.Mode=NSS_Signal_Hard_Input
PH10.Locked=true
PD2.Locked=true
SH.FMC_A14_BA0.0=FMC_BA0,TwoSdramBanks1
RCC.VCO2OutputFreq_Value=258000000
SH.FMC_A11.0=FMC_A11,13b-sda1
PC1.Locked=true
PB13.GPIO_Label=ULPI_D6
PC12.PinAttribute=CortexM4
PB15.Signal=GPIO_Input
PF12.GPIOParameters=GPIO_Label,PinAttribute
PE3.PinAttribute=CortexM4
PG15.Signal=FMC_SDNCAS
PG11.Signal=ETH_TX_EN
SH.S_TIM13_CH1.0=TIM13_CH1,Input_Capture1_from_TI1
PH5.GPIOParameters=GPIO_Label,PinAttribute
PJ5.GPIO_Label=ARD_D8
PB5.GPIOParameters=GPIO_Label,PinAttribute
PG15.PinAttribute=CortexM4
Mcu.Pin138=PB0
Mcu.Pin139=PJ3
Mcu.IP4=ETH
Mcu.IP5=FMC
Mcu.IP2=CORTEX_M4
Mcu.IP3=CORTEX_M7
PK4.GPIOParameters=GPIO_Label,PinAttribute
PI11.Mode=Device_HS
Mcu.IP0=ADC1
Mcu.IP1=ADC3
PE4.GPIOParameters=GPIO_Label,PinAttribute
PF9.Locked=true
SAI1.Instance-SAI_B_SPDIF=SAI$Index_Block_B
PH3.Locked=true
PF1.GPIOParameters=GPIO_Label,PinAttribute
RCC.DIVP3Freq_Value=129000000
RCC.SDMMCFreq_Value=129000000
PI9.PinAttribute=CortexM4
Mcu.Pin134=PD10
Mcu.Pin135=PD9
Mcu.Pin136=PA3
Mcu.Pin137=PC5
Mcu.Pin130=PH6
Mcu.Pin131=PH8
Mcu.Pin132=PB12
Mcu.Pin133=PB15
ProjectManager.PreviousToolchain=STM32CubeIDE
PF1.Locked=true
PG8.GPIOParameters=GPIO_Label,PinAttribute
PC0.PinAttribute=CortexM4
Mcu.Pin149=VP_LWIP_VS_Enabled
SH.FMC_NBL1.0=FMC_NBL1,Sd4ByteEnable1
PA1_C.Locked=true
PA8.GPIOParameters=GPIO_Label,PinAttribute
PE15.PinAttribute=CortexM4
Mcu.Pin140=PJ4
TIM8.IPParameters=Channel-Output Compare2 CH2 CH2N
RCC.HRTIMFreq_Value=64000000
Mcu.Pin145=PB13
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_1
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
Mcu.Pin146=PB14
RCC.DIVR3Freq_Value=129000000
Mcu.Pin147=PD8
Mcu.Pin148=VP_FREERTOS_M4_VS_CMSIS_V2
PA0_C.PinAttribute=CortexM4
Mcu.Pin141=PG1
SH.FMC_A14_BA0.ConfNb=1
Mcu.Pin142=PE7
Mcu.Pin143=PE14
Mcu.Pin144=PH7
Mcu.IP10=NVIC2
Mcu.IP12=RCC
Mcu.IP11=QUADSPI
PB12.PinAttribute=CortexM4
Mcu.IP18=SPI5
Mcu.IP17=SPI2
Mcu.IP19=SYS
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.DIVP1Freq_Value=129000000
Mcu.IP14=SAI1
PF9.Mode=Dual_Bank
Mcu.IP13=RTC
Mcu.IP16=SPDIFRX1
Mcu.IP15=SDMMC1
PI4.Locked=true
PH7.GPIO_Label=FMC_SDCKE1
PE8.Locked=true
PJ7.GPIO_Label=ARD_D6
PF11.Signal=FMC_SDNRAS
PC11.GPIO_Label=SDIO1_D3
PB5.Mode=Device_HS
PD14.PinAttribute=CortexM4
PE3.GPIOParameters=GPIO_Label,PinAttribute
PJ12.GPIO_Label=BL_CTRL
PK3.GPIOParameters=GPIO_Label,PinAttribute
PE3.Locked=true
Mcu.IP21=TIM8
PH6.GPIOParameters=GPIO_Label,PinAttribute
Mcu.IP20=SYS_M4
Mcu.IP23=UART8
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP22=TIM13
PF11.GPIOParameters=GPIO_Label,PinAttribute
CortexM7.IPs=BDMA\:I,DMA\:I,FATFS_M7\:I,FREERTOS_M7\:I,IWDG1\:I,MDMA\:I,NVIC1\:I,RCC\:I,USB_DEVICE_M7\:I,USB_HOST_M7\:I,WWDG1\:I,USART1\:I,CORTEX_M7\:I,DEBUG\:I,PDM2PCM_M7\:I,PWR\:I,RESMGR_UTILITY\:I,SYS\:I,VREFBUF\:I
PD10.PinAttribute=CortexM4
Mcu.IP25=USB_OTG_HS
SH.FMC_D27.ConfNb=1
Mcu.IP24=USART1
PB6.GPIOParameters=GPIO_Label,PinAttribute
PF8.PinAttribute=CortexM4
PB0.Locked=true
SH.FMC_D16.ConfNb=1
PJ13.Locked=true
PB12.Mode=Device_HS
PC10.PinAttribute=CortexM4
PG11.Locked=true
SH.FMC_D4_DA4.ConfNb=1
ProjectManager.ToolChainLocation=
RCC.DSIFreq_Value=62500000
PF8.Signal=S_TIM13_CH1
PG0.GPIO_Label=FMC_A10
SH.FMC_D30.ConfNb=1
RCC.DIVR1Freq_Value=129000000
PF4.PinAttribute=CortexM4
PI0.GPIO_Label=FMC_D24
Mcu.Pin95=PH4
Mcu.Pin96=PH5
PF4.Locked=true
Mcu.Pin93=PJ6
Mcu.Pin94=PH3
Mcu.Pin99=PF13
PB5.GPIO_Label=ULPI_D7
Mcu.Pin97=PI15
Mcu.Pin98=PJ1
PC3.PinAttribute=CortexM4
Mcu.Pin91=PJ8
PE12.PinAttribute=CortexM4
Mcu.Pin92=PJ7
PG11.GPIO_Label=ETH_TX_EN
PH8.PinAttribute=CortexM4
Mcu.Pin90=PE10
PC5.Signal=ETH_RXD1
PH2.Mode=Dual_Bank
PE7.Signal=FMC_D4_DA4
PF3.GPIO_Label=FMC_A3
SH.FMC_D22.ConfNb=1
PF15.GPIOParameters=GPIO_Label,PinAttribute
PE12.Locked=true
Mcu.Pin84=PC3
Mcu.Pin85=PJ9
Mcu.Pin82=PC1
PB15.Locked=true
PG2.GPIO_Label=FMC_A12
Mcu.Pin83=PC2
PH1-OSC_OUT\ (PH1).PinAttribute=CortexM7
Mcu.Pin88=PA1
PA3.Signal=USB_OTG_HS_ULPI_D0
Mcu.Pin89=PJ0
PF15.PinAttribute=CortexM4
PH1-OSC_OUT\ (PH1).GPIO_Label=OSC_OUT
Mcu.Pin86=PH2
Mcu.Pin87=PA2
SH.FMC_A3.ConfNb=1
PK1.Mode=NSS_Signal_Hard_Input
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
PB14.PinAttribute=Free
PK6.Signal=GPIO_Input
PK6.Locked=true
PK4.Locked=true
SH.FMC_D20.0=FMC_D20,sd-32b-d1
PH8.GPIOParameters=GPIO_Label,PinAttribute
PH15.Locked=true
PG7.Locked=true
PD15.GPIO_Label=FMC_D1
PG7.Signal=SAI1_MCLK_A
PE14.GPIOParameters=GPIO_Label,PinAttribute
PA10.Mode=Asynchronous
PJ8.Mode=Asynchronous
PA0_C.Signal=ADCx_INP0
PH13.PinAttribute=CortexM4
PH12.GPIO_Label=FMC_D20
PC9.GPIO_Label=SDIO1_D1
PE10.PinAttribute=CortexM4
PC11.Signal=SDMMC1_D3
PI14.Signal=GPIO_Output
PI15.PinAttribute=Free
PC8.Signal=SDMMC1_D0
PC10.Mode=SD_4_bits_Wide_bus
SH.FMC_D31.0=FMC_D31,sd-32b-d1
ProjectManager.DefaultFWLocation=true
PC2.Mode=Full_Duplex_Master
PE14.GPIO_Label=FMC_D11
PD9.Signal=FMC_D14_DA14
PE7.PinAttribute=CortexM4
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
boardIOC=true
SPI5.Mode=SPI_MODE_MASTER
PA12.GPIO_Label=SPI2_SCK
PinOutPanel.CurrentBGAView=Top
PJ8.PinAttribute=CortexM4
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
SH.ADCx_INP1.0=ADC1_INP1,IN1-Single-Ended
PE15.GPIOParameters=GPIO_Label,PinAttribute
PD8.GPIO_Label=FMC_D13
PI7.PinAttribute=CortexM4
PG8.GPIO_Label=FMC_SDCLK
USART1.VirtualMode-Asynchronous=VM_ASYNC
SAI1.RealAudioFreq-SAI_A_MasterWithClock=251.953 KHz
PI5.PinAttribute=CortexM4
PA9.Mode=Asynchronous
PJ5.Locked=true
PK2.GPIOParameters=GPIO_Label,PinAttribute
PH1-OSC_OUT\ (PH1).GPIOParameters=GPIO_Label,PinAttribute
PF10.PinAttribute=CortexM4
PH7.GPIOParameters=GPIO_Label,PinAttribute
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF6.Signal=QUADSPI_BK1_IO3
PC15-OSC32_OUT\ (OSC32_OUT).Signal=RCC_OSC32_OUT
PH8.Locked=true
PB10.GPIO_Label=ULPI_D3
RCC.VCO1OutputFreq_Value=258000000
SH.S_TIM13_CH1.ConfNb=1
PC3_C.Locked=true
PI13.PinAttribute=Free
PF6.Locked=true
SH.FMC_D13_DA13.0=FMC_D13,sd-32b-d1
PH8.Signal=FMC_D16
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
PC5.GPIOParameters=GPIO_Label,PinAttribute
RCC.AXIClockFreq_Value=64000000
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
PK0.GPIOParameters=GPIO_Label,PinAttribute
PE0.Locked=true
RCC.USBFreq_Value=129000000
PI5.GPIOParameters=GPIO_Label,PinAttribute
PF9.GPIO_Label=QSPI_BK1_IO1
SH.FMC_D24.ConfNb=1
PD10.GPIO_Label=FMC_D15
PA1.Signal=ETH_REF_CLK
RCC.CKPERFreq_Value=64000000
ProjectManager.BootMode=boot0
PD2.Mode=SD_4_bits_Wide_bus
PK0.PinAttribute=CortexM4
PH9.GPIOParameters=GPIO_Label,PinAttribute
PH1-OSC_OUT\ (PH1).Locked=true
SPI5.VirtualNSS=VM_NSSHARD
board=STM32H747I-DISCO
PG12.Mode=RMII
PF14.GPIOParameters=GPIO_Label,PinAttribute
PI9.Signal=FMC_D30
PH4.GPIO_Label=ULPI_NXT
PI9.Locked=true
SH.FMC_D22.0=FMC_D22,sd-32b-d1
PI13.GPIO_Label=LED2
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
MxCube.Version=5.6.1
PK7.PinAttribute=Free
PH15.PinAttribute=CortexM4
RCC.FDCANFreq_Value=129000000
PJ4.GPIOParameters=GPIO_Label,PinAttribute
PI4.Signal=FMC_NBL2
PE5.Mode=SAI_A_MasterWithClock
RCC.ADCFreq_Value=129000000
PA10.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIO_Label=ETH_MDC/SAI4_D1
VP_SYS_VS_Systick.Mode=SysTick
SH.FMC_D12_DA12.0=FMC_D12,sd-32b-d1
PF15.GPIO_Label=FMC_A9
SH.FMC_D29.ConfNb=1
PF14.Locked=true
PE5.Locked=true
SH.FMC_D18.ConfNb=1
PF1.Signal=FMC_A1
SH.FMC_D11_DA11.ConfNb=1
PA0_C.GPIOParameters=GPIO_Label,PinAttribute
PC13.Mode=Tamper 1 enabled - Input Enabled to TAMP1
PJ13.PinAttribute=Free
