haneefdm/mclasswifi/STM32H747I-DISCO/STM32H747I-DISCO.ioc
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CPU2Freq_Value,CPU2SystikFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,DSIFreq_Value,DSITXEscFreq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HRTIMFreq_Value,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLDSIVCOFreq_Value,PWR_Regulator_Voltage_Scale,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SupplySource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
PJ0.Signal=GPIO_Input
ProjectManager.AskForMigrate=true
PE0.Signal=FMC_NBL0
PE7.GPIO_Label=FMC_D4
PE12.Signal=FMC_D9_DA9
PB2.Locked=true
Mcu.IP8=LWIP
Mcu.IP9=NVIC1
PJ6.PinAttribute=CortexM4
Mcu.IP6=FREERTOS_M4
Mcu.IP7=HDMI_CEC
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=64000000
RCC.I2C123Freq_Value=64000000
PE5.PinAttribute=CortexM4
PA1.Locked=true
KeepUserPlacement=false
PC15-OSC32_OUT\ (OSC32_OUT).GPIO_Label=OSC32_OUT
PB2.Mode=Dual_Bank
PJ5.Signal=GPIO_Input
PB2.GPIO_Label=QSPI_CLK
PF13.GPIOParameters=GPIO_Label,PinAttribute
PD11.Mode=Dual_Bank
PF6.PinAttribute=CortexM4
PI6.GPIOParameters=GPIO_Label,PinAttribute
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PI3.GPIO_Label=FMC_D27
PH0-OSC_IN\ (PH0).GPIO_Label=OSC_IN
PH3.Signal=QUADSPI_BK2_IO1
PC3_C.Signal=ADC3_INP1
PA2.Mode=RMII
PC5.PinAttribute=CortexM4
PC8.Locked=true
PI14.Locked=true
SH.FMC_D8_DA8.ConfNb=1
PD9.Locked=true
PH6.PinAttribute=CortexM4
ADC3.NbrOfConversionFlag=1
SH.S_TIM8_CH2.ConfNb=1
PB12.Signal=USB_OTG_HS_ULPI_D5
PG11.GPIOParameters=GPIO_Label,PinAttribute
PE1.GPIOParameters=GPIO_Label,PinAttribute
PJ13.Signal=GPIO_Input
PK1.GPIO_Label=ARD_D10
PA3.GPIO_Label=ULPI_D0
PK1.GPIOParameters=GPIO_Label,PinAttribute
PH0-OSC_IN\ (PH0).GPIOParameters=GPIO_Label,PinAttribute
CortexM4.IPs=BDMA,DMA,FATFS_M4\:I,FREERTOS_M4\:I,IWDG2\:I,MDMA,NVIC2\:I,RCC,USB_DEVICE_M4\:I,USB_HOST_M4\:I,WWDG2\:I,USART1,USB_OTG_HS\:I,SPI2\:I,ADC1\:I,ADC3\:I,FMC\:I,QUADSPI\:I,SAI1\:I,ETH\:I,SPI5\:I,TIM8\:I,UART8\:I,DCMI\:I,RTC\:I,SDMMC1\:I,SPDIFRX1\:I,HDMI_CEC\:I,TIM13\:I,TIM3\:I,DEBUG,PDM2PCM_M4\:I,PWR,RESMGR_UTILITY,SYS_M4\:I,CORTEX_M4\:I,VREFBUF,LWIP\:I
PI2.PinAttribute=CortexM4
SH.FMC_D7_DA7.0=FMC_D7,sd-32b-d1
PK5.Locked=true
PK5.Signal=GPIO_Input
SH.FMC_D24.0=FMC_D24,sd-32b-d1
SH.FMC_A4.ConfNb=1
PJ9.Mode=Asynchronous
PH12.Signal=FMC_D20
PH12.Locked=true
SPI2.VirtualType=VM_MASTER
PK5.PinAttribute=Free
PB10.Mode=Device_HS
PC12.Locked=true
PK0.Mode=Full_Duplex_Master
PG4.Signal=FMC_A14_BA0
PG4.Locked=true
PC12.Signal=SDMMC1_CK
PB14.GPIO_Label=PMOD\#9
PG6.GPIO_Label=QSPI_BK1_NCS
PH6.GPIO_Label=FMC_SDNE1
PG3.GPIOParameters=GPIO_Label,PinAttribute
PK6.GPIO_Label=JOY_UP
PJ4.PinAttribute=Free
PJ3.PinAttribute=Free
PJ3.GPIOParameters=GPIO_Label,PinAttribute
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
RCC.CPU2Freq_Value=64000000
PC3.Locked=true
PI11.Locked=true
PA3.GPIOParameters=GPIO_Label,PinAttribute
PJ11.PinAttribute=CortexM4
PI6.GPIO_Label=FMC_D28
PB6.GPIO_Label=HDMI_CEC
PJ6.GPIO_Label=ARD_D9
PJ12.PinAttribute=Free
PC5.Mode=RMII
PB13.Signal=USB_OTG_HS_ULPI_D6
PG13.Signal=ETH_TXD0
PG6.Mode=Enable Chip Select 1 for both banks
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=SAI1_SD_A
PF6.GPIO_Label=QSPI_BK1_IO3
RCC.MCO1PinFreq_Value=64000000
PJ10.Signal=SPI5_MOSI
RCC.AHB4Freq_Value=64000000
PI3.PinAttribute=CortexM4
PJ10.Locked=true
PI1.PinAttribute=CortexM4
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PH10.PinAttribute=CortexM4
SH.FMC_A12.ConfNb=1
NVIC2.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
PJ13.GPIO_Label=PMOD\#12
PK6.PinAttribute=Free
PH5.Signal=FMC_SDNWE
PK4.PinAttribute=Free
PD15.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D10_DA10.ConfNb=1
PB6.Mode=CEC_Activate
RCC.DIVQ3Freq_Value=129000000
PC3.Signal=SPI2_MOSI
SH.FMC_D17.ConfNb=1
PE5.Signal=SAI1_SCK_A
PE10.Locked=true
PF10.GPIO_Label=ARD_A1
PB13.Locked=true
PH10.GPIO_Label=FMC_D18
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PG13.Locked=true
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB2.Signal=QUADSPI_CLK
PI4.PinAttribute=CortexM4
PD1.GPIOParameters=GPIO_Label,PinAttribute
PG1.GPIOParameters=GPIO_Label,PinAttribute
MxDb.Version=DB.5.0.60
PE15.Locked=true
PB0.GPIOParameters=GPIO_Label,PinAttribute
PE0.GPIOParameters=GPIO_Label,PinAttribute
PA1.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D26.0=FMC_D26,sd-32b-d1
PJ1.GPIOParameters=GPIO_Label,PinAttribute
PI6.Signal=FMC_D28
PI3.Signal=FMC_D27
SH.FMC_D15_DA15.ConfNb=1
SPI2.CalculateBaudRate=64.5 MBits/s
ADC3.IPParameters=Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag
PJ1.PinAttribute=Free
PJ10.PinAttribute=CortexM4
PF3.Signal=FMC_A3
SH.FMC_D25.ConfNb=1
PJ5.PinAttribute=Free
RCC.DIVR2Freq_Value=129000000
PE10.Signal=FMC_D7_DA7
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
RCC.MCO2PinFreq_Value=64000000
PC8.GPIOParameters=GPIO_Label,PinAttribute
PH10.GPIOParameters=GPIO_Label,PinAttribute
PF8.GPIOParameters=GPIO_Label,PinAttribute
PI0.PinAttribute=CortexM4
PI8.GPIOParameters=GPIO_Label,PinAttribute
FREERTOS_M4.Tasks01=defaultTask,24,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
PD11.Locked=true
PG13.GPIOParameters=GPIO_Label,PinAttribute
PJ5.GPIOParameters=GPIO_Label,PinAttribute
PE10.GPIOParameters=GPIO_Label,PinAttribute
PJ4.Signal=GPIO_Input
RCC.DFSDMFreq_Value=64000000
SAI1.VirtualMode-SAI_B_SPDIF=VM_SPDIF
PA5.GPIOParameters=GPIO_Label,PinAttribute
PB14.GPIOParameters=GPIO_Label,PinAttribute
PF0.PinAttribute=CortexM4
SH.FMC_A1.0=FMC_A1,13b-sda1
PH2.Signal=QUADSPI_BK2_IO0
SH.FMC_SDCLK.0=FMC_SDCLK,13b-sda1
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=64000000
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=129000000
PF14.Signal=FMC_A8
PI4.GPIOParameters=GPIO_Label,PinAttribute
PH4.PinAttribute=CortexM4
PJ13.GPIOParameters=GPIO_Label,PinAttribute
PB10.GPIOParameters=GPIO_Label,PinAttribute
PI11.Signal=USB_OTG_HS_ULPI_DIR
PE10.GPIO_Label=FMC_D7
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
SH.FMC_D3_DA3.0=FMC_D3,sd-32b-d1
SPI5.VirtualType=VM_MASTER
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label,PinAttribute
RCC.SupplySource=PWR_DIRECT_SMPS_SUPPLY
PG0.PinAttribute=CortexM4
PF4.GPIOParameters=GPIO_Label,PinAttribute
PC4.Mode=RMII
PI10.GPIO_Label=FMC_D31
PH12.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A7.ConfNb=1
PH15.Signal=FMC_D23
PK1.PinAttribute=CortexM4
SH.FMC_A1.ConfNb=1
TIM8.Channel-Output\ Compare2\ CH2\ CH2N=TIM_CHANNEL_2
PJ15.GPIOParameters=GPIO_Label,PinAttribute
ADC1.Rank-0\#ChannelRegularConversion=1
SH.FMC_D28.0=FMC_D28,sd-32b-d1
PD9.GPIO_Label=FMC_D14
PF1.PinAttribute=CortexM4
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master
PG9.Locked=true
PG9.Signal=QUADSPI_BK2_IO2
PA9.GPIO_Label=STLINK_RX
RCC.SWPMI1Freq_Value=64000000
PB11.GPIO_Label=ULPI_D4
PE0.PinAttribute=CortexM4
PD7.Signal=SPDIFRX1_IN0
PD1.Signal=FMC_D3_DA3
PA11.GPIO_Label=PMOD\#1
PF14.GPIO_Label=FMC_A8
PC0.Signal=USB_OTG_HS_ULPI_STP
PK2.Locked=true
PC11.GPIOParameters=GPIO_Label,PinAttribute
RCC.QSPIFreq_Value=64000000
PF13.GPIO_Label=FMC_A7
PG13.GPIO_Label=ETH_TXD0
PJ15.PinAttribute=Free
SH.S_TIM8_CH2.0=TIM8_CH2,Output Compare2 CH2 CH2N
SH.FMC_A3.0=FMC_A3,13b-sda1
RCC.USART234578Freq_Value=64000000
PJ7.Signal=TIM8_CH2N
PA11.Locked=true
PK2.PinAttribute=Free
PH12.PinAttribute=CortexM4
PA12.PinAttribute=CortexM4
SH.FMC_D31.ConfNb=1
RCC.SPI123Freq_Value=129000000
PB11.Mode=Device_HS
TIM13.Channel=TIM_CHANNEL_1
SH.FMC_D15_DA15.0=FMC_D15,sd-32b-d1
PC3_C.GPIOParameters=GPIO_Label,PinAttribute
NVIC2.ForceEnableDMAVector=true
PA9.Signal=USART1_TX
PH3.PinAttribute=CortexM4
PB5.Locked=true
PC2_C.Mode=IN0-Single-Ended
PI1.Locked=true
PD7.Locked=true
PE9.GPIO_Label=FMC_D6
SH.FMC_D17.0=FMC_D17,sd-32b-d1
PF12.PinAttribute=CortexM4
PB10.Signal=USB_OTG_HS_ULPI_D3
PG3.PinAttribute=Free
PJ15.Signal=GPIO_Input
PH9.GPIO_Label=FMC_D17
PG1.PinAttribute=CortexM4
PI9.GPIO_Label=FMC_D30
PH6.Mode=SdramChipSelect2_1
ProjectManager.LastFirmware=true
Mcu.Pin116=PE15
PI2.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin117=PJ5
PF2.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin118=PH9
Mcu.Pin119=PH12
VP_TIM13_VS_ClockSourceINT.Mode=Enable_Timer
PI6.Locked=true
PK3.PinAttribute=Free
PA1.Mode=RMII
SH.FMC_D20.ConfNb=1
PH11.PinAttribute=CortexM4
PE15.Signal=FMC_D12_DA12
PA11.PinAttribute=CortexM4
PE8.Signal=FMC_D5_DA5
PI1.Signal=FMC_D25
RCC.RNGFreq_Value=48000000
PC2.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin112=PB2
Mcu.Pin113=PF12
PH2.PinAttribute=CortexM4
Mcu.Pin114=PF15
PF12.Locked=true
Mcu.Pin115=PE12
PF11.Locked=true
Mcu.Pin110=PC3_C
Mcu.Pin111=PA7
PA9.Locked=true
Mcu.Pin127=PG0
Mcu.Pin128=PE8
SH.ADCx_INP0.ConfNb=1
Mcu.Pin129=PE13
PE1.PinAttribute=CortexM4
PI0.Locked=true
PE7.Locked=true
SH.FMC_SDNCAS.0=FMC_SDNCAS,13b-sda1
PG14.GPIO_Label=QSPI_BK2_IO3
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=64000000
SH.FMC_NBL1.ConfNb=1
PJ1.Locked=true
ADC3.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_0
PH4.Mode=Device_HS
ProjectManager.UnderRoot=true
PE13.Locked=true
PH14.GPIO_Label=FMC_D22
SH.FMC_D7_DA7.ConfNb=1
Mcu.Pin123=PA5
PJ15.Locked=true
Mcu.Pin124=PC4
Mcu.Pin125=PB1
Mcu.Pin126=PF11
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
PB5.Signal=USB_OTG_HS_ULPI_D7
PG15.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin120=PD11
Mcu.Pin121=PA0_C
Mcu.Pin122=PA1_C
PE13.GPIO_Label=FMC_D10
SAI1.RealAudioFreq-SAI_B_SPDIF=2.015625 MHz
PC3_C.PinAttribute=CortexM4
PD11.Signal=QUADSPI_BK1_IO0
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
PG11.Mode=RMII
SH.FMC_A5.0=FMC_A5,13b-sda1
PA11.Signal=SPI2_NSS
PD1.PinAttribute=CortexM4
PJ7.Locked=true
PK3.GPIO_Label=JOY_DOWN
PH5.Locked=true
LWIP.Version=v2.0.3_Cube
PF2.PinAttribute=CortexM4
PF8.Locked=true
PF6.Mode=Dual_Bank
RCC.LPTIM345Freq_Value=64000000
ProjectManager.ComputerToolchain=false
PF9.Signal=QUADSPI_BK1_IO1
PJ10.Mode=Full_Duplex_Master
RCC.LTDCFreq_Value=129000000
Mcu.Pin109=PC2_C
PC3.GPIO_Label=PMOD\#2
PF3.Locked=true
PJ7.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin105=PH10
PA8.Mode=Clock-out-1
Mcu.Pin106=PH11
Mcu.Pin107=PD15
Mcu.Pin108=PD14
PE12.GPIOParameters=GPIO_Label,PinAttribute
PE14.PinAttribute=CortexM4
SH.FMC_NBL3.0=FMC_NBL3,Sd4ByteEnable1
PG3.GPIO_Label=DSI_Reset
SH.FMC_D12_DA12.ConfNb=1
RCC.HCLK3ClockFreq_Value=64000000
PD1.Locked=true
SPI5.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
PA1_C.PinAttribute=CortexM4
PB0.Signal=USB_OTG_HS_ULPI_D1
Mcu.ContextNb=2
SH.FMC_D19.0=FMC_D19,sd-32b-d1
PA7.GPIOParameters=GPIO_Label,PinAttribute
RCC.CPU2SystikFreq_Value=64000000
PC0.Locked=true
PC1.Signal=ETH_MDC
PF13.PinAttribute=CortexM4
PB12.GPIOParameters=GPIO_Label,PinAttribute
PD7.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=SDIO1_CMD
PG7.GPIOParameters=GPIO_Label,PinAttribute
PH2.GPIO_Label=QSPI_BK2_IO0
Mcu.Pin101=PE9
Mcu.Pin102=PE11
Mcu.Pin103=PB10
Mcu.Pin104=PB11
PG2.PinAttribute=CortexM4
Mcu.Pin100=PF14
PC3.Mode=Full_Duplex_Master
RCC.DIVQ2Freq_Value=129000000
PK7.Signal=GPIO_Input
PK7.Locked=true
RCC.SAI1Freq_Value=129000000
RCC.CortexFreq_Value=64000000
SH.FMC_A2.ConfNb=1
PG6.Signal=QUADSPI_BK1_NCS
PH14.Locked=true
PI10.GPIOParameters=GPIO_Label,PinAttribute
Mcu.UserName=STM32H747XIHx
PF5.PinAttribute=CortexM4
PD9.GPIOParameters=GPIO_Label,PinAttribute
PJ9.GPIOParameters=GPIO_Label,PinAttribute
PH0-OSC_IN\ (PH0).Locked=true
PC10.Locked=true
PG6.Locked=true
PC10.Signal=SDMMC1_D2
PA1_C.Signal=ADCx_INP1
SH.FMC_NBL0.0=FMC_NBL0,Sd4ByteEnable1
PI13.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM7,2-SystemClock_Config-RCC-false-HAL-false-CortexM7,3-MX_USART1_UART_Init-USART1-false-HAL-true-CortexM7,1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM4,2-MX_ADC1_Init-ADC1-false-HAL-true-CortexM4,3-MX_ADC3_Init-ADC3-false-HAL-true-CortexM4,4-MX_FMC_Init-FMC-false-HAL-true-CortexM4,5-MX_HDMI_CEC_Init-HDMI_CEC-false-HAL-true-CortexM4,6-MX_QUADSPI_Init-QUADSPI-false-HAL-true-CortexM4,7-MX_RTC_Init-RTC-false-HAL-true-CortexM4,8-MX_SAI1_Init-SAI1-false-HAL-true-CortexM4,9-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true-CortexM4,10-MX_SPDIFRX1_Init-SPDIFRX1-false-HAL-true-CortexM4,11-MX_SPI2_Init-SPI2-false-HAL-true-CortexM4,12-MX_SPI5_Init-SPI5-false-HAL-true-CortexM4,13-MX_TIM8_Init-TIM8-false-HAL-true-CortexM4,14-MX_TIM13_Init-TIM13-false-HAL-true-CortexM4,15-MX_UART8_Init-UART8-false-HAL-true-CortexM4,16-MX_USART1_UART_Init-USART1-true-HAL-false-CortexM4,17-MX_USB_OTG_HS_PCD_Init-USB_OTG_HS-false-HAL-true-CortexM4,18-MX_FREERTOS_Init-FREERTOS_M4-false-HAL-false-CortexM4,19-MX_LWIP_Init-LWIP-false-HAL-false-CortexM4,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true-CortexM7,0-MX_CORTEX_M4_Init-CORTEX_M4-false-HAL-true-CortexM4
PC0.GPIOParameters=GPIO_Label,PinAttribute
PC0.GPIO_Label=ULPI_STP
SH.FMC_D6_DA6.0=FMC_D6,sd-32b-d1
PB0.GPIO_Label=ULPI_D1
PI5.GPIO_Label=FMC_NBL3
PH5.GPIO_Label=FMC_SDNWE
PC13.GPIO_Label=B2 [Wakeup Button]
PK5.GPIO_Label=JOY_RIGHT
PB11.Signal=USB_OTG_HS_ULPI_D4
PI0.GPIOParameters=GPIO_Label,PinAttribute
PK5.GPIOParameters=GPIO_Label,PinAttribute
PC11.PinAttribute=CortexM4
PI14.GPIO_Label=LED3
PE4.PinAttribute=CortexM4
PE5.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.StackSize=0x400
PI11.GPIOParameters=GPIO_Label,PinAttribute
RCC.VCOInput3Freq_Value=2000000
PH3.Mode=Dual_Bank
PJ6.Locked=true
PJ6.Signal=S_TIM8_CH2
PB11.PinAttribute=CortexM4
PA12.Locked=true
SH.FMC_A7.0=FMC_A7,13b-sda1
PA12.Signal=SPI2_SCK
PH4.GPIOParameters=GPIO_Label,PinAttribute
Mcu.UserConstants=
PH7.Locked=true
PI1.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIOParameters=GPIO_Label,PinAttribute
PF5.Locked=true
Mcu.ThirdPartyNb=0
PA10.PinAttribute=CortexM7
PD11.GPIO_Label=QSPI_BK1_IO0
RCC.HCLKFreq_Value=64000000
Mcu.IPNb=26
PH7.PinAttribute=CortexM4
RCC.SPDIFRXFreq_Value=129000000
PF11.GPIO_Label=FMC_SDRAS
PH9.PinAttribute=CortexM4
PF12.Signal=FMC_A6
PD8.GPIOParameters=GPIO_Label,PinAttribute
PE13.PinAttribute=CortexM4
PH15.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin6=PC10
Mcu.Pin7=PI1
PJ8.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin8=PI0
Mcu.Pin9=PI7
PI13.Signal=GPIO_Output
PC2.PinAttribute=CortexM4
PC2_C.Signal=ADC3_INP0
SH.FMC_A10.0=FMC_A10,13b-sda1
Mcu.Pin0=PI6
Mcu.Pin1=PI5
Mcu.Pin2=PI4
PF14.PinAttribute=CortexM4
Mcu.Pin3=PB5
PK3.Locked=true
Mcu.Pin4=PK5
PD10.GPIOParameters=GPIO_Label,PinAttribute
PB0.PinAttribute=CortexM4
Mcu.Pin5=PG9
ADC3.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
SH.FMC_D8_DA8.0=FMC_D8,sd-32b-d1
PG14.PinAttribute=CortexM4
PI8.Signal=GPIO_Input
SH.FMC_D2_DA2.0=FMC_D2,sd-32b-d1
PD0.PinAttribute=CortexM4
PE13.Signal=FMC_D10_DA10
PF3.PinAttribute=CortexM4
PF7.GPIO_Label=QSPI_BK1_IO2
PI5.Locked=true
PI5.Signal=FMC_NBL3
PI0.Signal=FMC_D24
PI8.PinAttribute=Free
File.Version=6
PA10.GPIO_Label=STLINK_TX
SH.FMC_D5_DA5.ConfNb=1
PH3.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D2_DA2.ConfNb=1
PG13.Mode=RMII
PE4.Mode=SAI_A_MasterWithClock
PK6.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_SDNRAS.0=FMC_SDNRAS,13b-sda1
PF7.PinAttribute=CortexM4
PE4.Signal=SAI1_FS_A
PE6.GPIOParameters=GPIO_Label,PinAttribute
PC2_C.Locked=true
PI12.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.ProjectName=STM32H747I-DISCO
PD7.GPIO_Label=SPDIF_RX0
PH7.Mode=SdramChipSelect2_1
RCC.APB3Freq_Value=64000000
PC2_C.PinAttribute=CortexM4
PJ9.PinAttribute=CortexM4
PA7.Locked=true
PJ9.Signal=UART8_RX
SH.FMC_D0_DA0.0=FMC_D0,sd-32b-d1
PJ12.Signal=GPIO_Output
PK0.GPIO_Label=ARD_D13
PA2.GPIO_Label=ETH_MDIO
PD14.Locked=true
PG8.PinAttribute=CortexM4
PF5.GPIO_Label=FMC_A5
SH.FMC_A9.0=FMC_A9,13b-sda1
VP_TIM13_VS_ClockSourceINT.Signal=TIM13_VS_ClockSourceINT
PJ1.Signal=GPIO_Input
SH.FMC_D4_DA4.0=FMC_D4,sd-32b-d1
PI12.GPIO_Label=LED1
PE0.GPIO_Label=FMC_NBL0
PF5.Signal=FMC_A5
PH3.GPIO_Label=QSPI_BK2_IO1
PH7.Signal=FMC_SDCKE1
PJ3.GPIO_Label=ARD_D2
PK2.GPIO_Label=JOY_SEL
SH.FMC_D19.ConfNb=1
PC4.Locked=true
SH.FMC_D30.0=FMC_D30,sd-32b-d1
PJ7.Mode=Output Compare2 CH2 CH2N
SPI2.Direction=SPI_DIRECTION_2LINES
PF0.Signal=FMC_A0
PI2.GPIO_Label=FMC_D26
SH.FMC_NBL0.ConfNb=1
PF11.PinAttribute=CortexM4
PE3.Mode=SAI_B_SPDIF
PC2.GPIO_Label=PMOD\#3
RCC.Tim2OutputFreq_Value=64000000
VP_LWIP_VS_Enabled.Signal=LWIP_VS_Enabled
PG4.PinAttribute=CortexM4
RCC.DFSDMACLkFreq_Value=129000000
PH14.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A12.0=FMC_A12,13b-sda1
PA2.Locked=true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PI6.PinAttribute=CortexM4
PE8.GPIOParameters=GPIO_Label,PinAttribute
PK2.Signal=GPIO_Input
SH.FMC_A9.ConfNb=1
PA7.Mode=RMII
PC10.GPIO_Label=SDIO1_D2
PH11.Signal=FMC_D19
ProjectManager.NoMain=false
PG3.Signal=GPIO_Output
PG1.Signal=FMC_A11
PG1.Locked=true
PJ0.PinAttribute=Free
RCC.SAI4BFreq_Value=129000000
SH.FMC_SDCLK.ConfNb=1
PI14.PinAttribute=Free
PC4.Signal=ETH_RXD0
PI14.GPIOParameters=GPIO_Label,PinAttribute
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
PI10.Signal=FMC_D31
PK0.Locked=true
PJ7.PinAttribute=CortexM4
PI13.GPIOParameters=GPIO_Label,PinAttribute
VP_LWIP_VS_Enabled.Mode=Enabled
PC0.Mode=Device_HS
PJ9.Locked=true
PJ11.Mode=Full_Duplex_Master
PB13.PinAttribute=CortexM4
