haneefdm/mclasswifi/STM32H747I-DISCO/STM32H747I-DISCO.ioc
PE9.GPIOParameters=GPIO_Label,PinAttribute
PC14-OSC32_IN\ (OSC32_IN).Locked=true
RCC.DSITXEscFreq_Value=15625000
RCC.SPI6Freq_Value=64000000
PH13.GPIO_Label=FMC_D21
PC8.GPIO_Label=SDIO1_D0
PC12.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D21.0=FMC_D21,sd-32b-d1
PF7.Mode=Dual_Bank
PH8.GPIO_Label=FMC_D16
SH.FMC_NBL3.ConfNb=1
RCC.SPI45Freq_Value=64000000
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE15.GPIO_Label=FMC_D12
PH4.Signal=USB_OTG_HS_ULPI_NXT
PK7.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.TargetToolchain=STM32CubeIDE
PH14.PinAttribute=CortexM4
PE7.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D1_DA1.ConfNb=1
PE11.PinAttribute=CortexM4
PC14-OSC32_IN\ (OSC32_IN).PinAttribute=CortexM7
PF15.Locked=true
PB2.GPIOParameters=GPIO_Label,PinAttribute
PH5.PinAttribute=CortexM4
PJ9.GPIO_Label=ARD_D0
NVIC1.ForceEnableDMAVector=true
PC15-OSC32_OUT\ (OSC32_OUT).GPIOParameters=GPIO_Label,PinAttribute
PE4.Locked=true
PF2.Signal=FMC_A2
PC4.PinAttribute=CortexM4
PC2.Locked=true
PF5.GPIOParameters=GPIO_Label,PinAttribute
PH2.GPIOParameters=GPIO_Label,PinAttribute
PH11.Locked=true
SH.FMC_D28.ConfNb=1
VP_FREERTOS_M4_VS_CMSIS_V2.Mode=CMSIS_V2
PG7.Mode=SAI_A_MasterWithClock
PE11.Signal=FMC_D8_DA8
PK0.Signal=SPI5_SCK
PB1.Locked=true
PG9.GPIO_Label=QSPI_BK2_IO2
PG14.Signal=QUADSPI_BK2_IO3
SH.ADCx_INP0.0=ADC1_INP0,IN0-Single-Ended
PJ10.GPIO_Label=ARD_D11
PB0.Mode=Device_HS
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,Instance-SAI_B_SPDIF,VirtualMode-SAI_B_SPDIF,RealAudioFreq-SAI_B_SPDIF
PG1.GPIO_Label=FMC_A11
PB5.PinAttribute=CortexM4
PD11.GPIOParameters=GPIO_Label,PinAttribute
RCC.VCOInput1Freq_Value=2000000
PI8.Locked=true
RCC.APB2Freq_Value=64000000
PG4.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D13_DA13.ConfNb=1
PI3.Locked=true
PC13.GPIOParameters=GPIO_Label,PinAttribute
PF10.Signal=ADC3_INP6
PI7.GPIO_Label=FMC_D29
PF15.Signal=FMC_A9
PD14.GPIO_Label=FMC_D0
PF0.Locked=true
PE6.Signal=SAI1_SD_A
PB15.GPIOParameters=GPIO_Label,PinAttribute
PD11.PinAttribute=CortexM4
PE11.Locked=true
Mcu.Name=STM32H747XIHx
SH.FMC_D23.ConfNb=1
PE6.PinAttribute=CortexM4
PA2.Signal=ETH_MDIO
PC13.PinAttribute=CortexM4
PD14.Signal=FMC_D0_DA0
PA7.GPIO_Label=ETH_CRS_DV
PA12.Mode=Full_Duplex_Master
PG12.Locked=true
PC14-OSC32_IN\ (OSC32_IN).Signal=RCC_OSC32_IN
PC5.GPIO_Label=ETH_RXD1
SH.FMC_D23.0=FMC_D23,sd-32b-d1
PG6.PinAttribute=CortexM4
PJ4.Locked=true
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PF6.GPIOParameters=GPIO_Label,PinAttribute
PG12.GPIO_Label=ETH_TXD1
PH2.Locked=true
RCC.SAI4AFreq_Value=129000000
ADC1.NbrOfConversionFlag=1
PI15.Signal=GPIO_Output
PC15-OSC32_OUT\ (OSC32_OUT).PinAttribute=CortexM7
RCC.DIVQ1Freq_Value=129000000
PC2_C.GPIOParameters=GPIO_Label,PinAttribute
PE3.GPIO_Label=SAI1_SD_B
PC9.Signal=SDMMC1_D1
RCC.VCOInput2Freq_Value=2000000
RCC.APB1Freq_Value=64000000
PJ11.GPIOParameters=GPIO_Label,PinAttribute
PB11.Locked=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
ProjectManager.DeviceId=STM32H747XIHx
ProjectManager.LibraryCopy=1
SPI5.Direction=SPI_DIRECTION_2LINES
PB1.GPIOParameters=GPIO_Label,PinAttribute
PJ12.Locked=true
PA7.Signal=ETH_CRS_DV
PF2.GPIO_Label=FMC_A2
